Tekla Open API Reference for Tekla Structures 2025
FormBase.SaveValues Method
 Serializes the dialog values to an xml file.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SaveValues(
	string fileName
)
Public Sub SaveValues (
	fileName As String
)
Parameters
fileName
Type: System.String
The path of the file.
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace